app/controllers/line_items_controller.rb

SELECT "line_items".* FROM "line_items"
---
  def index
    @line_items = LineItem.all

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 15]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2016-02-17 18:58:53.650468"], ["updated_at", "2016-02-17 18:58:53.650468"]]
INSERT INTO "line_items" ("product_id", "cart_id", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["product_id", 42], ["cart_id", 43], ["price", 0.0], ["created_at", "2016-02-22 13:42:25.346327"], ["updated_at", "2016-02-22 13:42:25.346327"]]
UPDATE "line_items" SET "quantity" = ?, "price" = ?, "updated_at" = ? WHERE "line_items"."id" = ?  [["quantity", 2], ["price", 0.0], ["updated_at", "2016-02-22 13:42:28.873963"], ["id", 237]]
---
  def create
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)

    respond_to do |format|
      if @line_item.save