app/controllers/orders_controller.rb

  def index
    @orders = Order.all
---
SELECT "orders".* FROM "orders"

  def new
	  if @cart.line_items.empty?
---
SELECT  1 AS one FROM "line_items" WHERE "line_items"."cart_id" = ? LIMIT 1  [["cart_id", 11]]
SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = ?  [["cart_id", 11]]

  def create
    @order = Order.new(order_params)
    @order.add_line_items_from_cart(@cart)

    respond_to do |format|
      if @order.save
       Cart.destroy(session[:cart_id])
---
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2016-02-24 13:11:01.963790"], ["updated_at", "2016-02-24 13:11:01.963790"]]
INSERT INTO "orders" ("name", "address", "email", "pay_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Ari"], ["address", "Laprida"], ["email", "holi"], ["pay_type", "Credit card"], ["created_at", "2016-02-22 13:54:54.119717"], ["updated_at", "2016-02-22 13:54:54.119717"]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 44]]

    def set_order
      @order = Order.find(params[:id])
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", 4]]