app/controllers/products_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 3]]
---
  def who_bought
    @product = Product.find(params[:id])

SELECT "products".* FROM "products"
---
  def index
    @products = Product.all

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
     @product = Product.find(params[:title])

INSERT INTO "products" ("title", "description", "image_url", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Mochila"], ["description", "Azul y grande"], ["image_url", "mochila.jpg"], ["price", 50.0], ["created_at", "2016-02-17 14:51:13.514891"], ["updated_at", "2016-02-17 14:51:13.514891"]]
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

UPDATE "products" SET "description" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["description", "Azul y grande"], ["updated_at", "2016-02-17 15:34:03.785234"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 5]]
---
    def set_product
      @product = Product.find(params[:id])