app/controllers/store_controller.rb

  def index
    if params[:set_locale]
      redirect_to store_index_url(locale: params[:set_locale])
    else
      @products = Product.order(:title)
---
SELECT "products".* FROM "products"  ORDER BY "products"."title" ASC